In [2]:
import matplotlib.pyplot as plt
print(plt.get_backend())

module://matplotlib_inline.backend_inline

In [1]:
# %matplotlib inline - matplotlib inline is the default backend in a jupyter notebook, now no longer required
import pandas as pd

In [7]:
'''
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))
'''

In [38]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                                  title  year
0  Amore e morte nel giardino degli dei  1972
1                                  Kris  1946
2                       Kaptein Caprivi  1972
3                         Svenska Floyd  1961
4                            Homo Faber  1991

In [3]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [39]:
len(titles)

226013

### What are the earliest two films listed in the titles dataframe?

In [41]:
titles.sort_values('year').head(2)

                     title  year
67819           Miss Jerry  1894
207284  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [100]:
# Depending on how you interpret the question you can arrive at different counts 

# Only count titles that appear as 'Hamlet'
count = (titles['title'] == 'Hamlet').sum()
print("Number of titles appearing as 'Hamlet': " + str(count))

# Count the number of titles that start with the word 'Hamlet' 
count2 = titles['title'].str.startswith('Hamlet').sum()
print("Number of titles that start with 'Hamlet': " + str(count2))

# Count the number of titles that contain the word 'Hamlet' in them 
count3 = titles['title'].str.contains(r'Hamlet').sum()
print("Number of titles that contain 'Hamlet': " + str(count3))

Number of titles appearing as 'Hamlet': 20
Number of titles that start with 'Hamlet': 40
Number of titles that contain 'Hamlet': 55

In [99]:
titles.title[titles['title'].str.contains(r'Hamlet')]

4760                           A Sagebrush Hamlet
6783                                  Hamlet (II)
11143                      Hamlet in the Hamptons
14413                              Kitchen Hamlet
18430                                    Hamlet 2
22516                                      Hamlet
27282                                      Hamlet
33005                                      Hamlet
38298                   Hamlet, Prince of Denmark
42263                                      Hamlet
43896                              Hamlet Unbound
52395                                      Hamlet
56073                                 Fuck Hamlet
61104                                      Hamlet
63445                              Hamlet/Horatio
65986                    Hamlet, Son of a Kingpin
71088                                 Hamlet (II)
84358                                      Hamlet
86506                   Hamlet in the Golden Vale
86508                 Intikam Melegi/Kadin Hamlet
90989                   Hamlet the Vampire Slayer
93844     The Tragedy of Hamlet Prince of Denmark
97195                        Hamlet Demonstration
99427               Hamlet: The Fall of a Sparrow
100396                  Hamlet: Prince of Denmark
102852                                   Hamlet X
103798                         Han, hun og Hamlet
104292                                     Hamlet
114224                                     Hamlet
117952                              Hamlet A.D.D.
119517                                Hamlet (II)
120670          Royal Shakespeare Company: Hamlet
121837              National Theatre Live: Hamlet
122000                                     Hamlet
126862                                     Hamlet
136835                                Hamlet (II)
140267                                     Hamlet
142304                                     Hamlet
148015            Dogg's Hamlet, Cahoot's Macbeth
150932                         Han, hun og Hamlet
151503        Predstava 'Hamleta' u Mrdusi Donjoj
152474                      Green Eggs and Hamlet
153773                                     Hamlet
165082                        Harry, Hamlet and I
167194                               Hamlet (III)
167198                                     Hamlet
168528                                     Hamlet
170016                                     Hamlet
175118                                     Hamlet
182160                             Hamlet's Ghost
190376                                     Hamlet
191868                                     Hamlet
203335                              Zombie Hamlet
208269                               H for Hamlet
215453                     Hamlet liikemaailmassa
Name: title, dtype: object

### How many movies are titled "North by Northwest"?

In [102]:
titles['title'].str.fullmatch(r'North by Northwest').sum()

1

### When was the first movie titled "Hamlet" made?

In [104]:
hamlets = titles[titles.title == 'Hamlet'].sort_values('year')
hamlets.head(1)

         title  year
170016  Hamlet  1910

In [106]:
hamlets2 = titles[titles.title.str.startswith(r'Hamlet')].sort_values('year')
hamlets2.head(1)

         title  year
170016  Hamlet  1910

In [109]:
hamlets3 = titles[titles.title.str.contains(r'Hamlet')].sort_values('year')
hamlets3.head(1)

         title  year
170016  Hamlet  1910

Reguardless of how we filtered `title`, the first movie will be Hamlet 1910 since it is the earliest movie containing the word `Hamlet`.

### List all of the "Treasure Island" movies from earliest to most recent.

In [111]:
treasure_island_movies = titles[titles.title == 'Treasure Island'].sort_values('year')
treasure_island_movies

                  title  year
156319  Treasure Island  1918
165371  Treasure Island  1920
137464  Treasure Island  1934
184980  Treasure Island  1950
191292  Treasure Island  1972
89978   Treasure Island  1973
159906  Treasure Island  1985
191353  Treasure Island  1999

### How many movies were made in the year 1950?

In [120]:
made_in_1950 = titles[titles.year == 1950]
len(made_in_1950)

1109

### How many movies were made in the year 1960?

In [121]:
made_in_1960 = titles[titles.year == 1960]
len(made_in_1960)

1496

### How many movies were made from 1950 through 1959?

In [124]:
made_between_1950_1959 = titles[(1950 < titles.year) & (titles.year < 1959)]
len(made_between_1950_1959)

10093

### In what years has a movie titled "Batman" been released?

In [125]:
titles.year[titles.title == 'Batman']

20791    1989
68816    1943
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branagh’s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

# Exercise 1 Lecture Notes

In [4]:
titles

                                       title  year
0       Amore e morte nel giardino degli dei  1972
1                                       Kris  1946
2                            Kaptein Caprivi  1972
3                              Svenska Floyd  1961
4                                 Homo Faber  1991
...                                      ...   ...
226008                Les mannequins d'osier  1989
226009                                Krejzi  1989
226010                               Kvinder  1914
226011             Il racconto della giungla  1974
226012                              Soul Men  2008

[226013 rows x 2 columns]

In [5]:
# The number of rows 
len(titles)

226013

`head()` and `tail()` are data operations, it builds a new dataframe. It can be used to subset the data after sorting.

In [8]:
# subset of dataframe, default first 5 rows
h = titles.head()

In [10]:
h

                                  title  year
0  Amore e morte nel giardino degli dei  1972
1                                  Kris  1946
2                       Kaptein Caprivi  1972
3                         Svenska Floyd  1961
4                            Homo Faber  1991

In [7]:
# subset of dataframe, default last 5 rows
titles.tail()

                            title  year
226008     Les mannequins d'osier  1989
226009                     Krejzi  1989
226010                    Kvinder  1914
226011  Il racconto della giungla  1974
226012                   Soul Men  2008

# Filtering

In [17]:
# turn years into decades 
h['year'] // 10 * 10

0    1970
1    1940
2    1970
3    1960
4    1990
Name: year, dtype: int64

In [21]:
h.year > 1985

0    False
1    False
2    False
3    False
4     True
Name: year, dtype: bool

In [22]:
h[h.year > 1985]

        title  year
4  Homo Faber  1991

In [24]:
h[h.year < 1985]

                                  title  year
0  Amore e morte nel giardino degli dei  1972
1                                  Kris  1946
2                       Kaptein Caprivi  1972
3                         Svenska Floyd  1961

In [27]:
h[ (h.year < 1980) | (h.year >= 1990)]

                                  title  year
0  Amore e morte nel giardino degli dei  1972
1                                  Kris  1946
2                       Kaptein Caprivi  1972
3                         Svenska Floyd  1961
4                            Homo Faber  1991

In [31]:
t = titles
t[t.title == 'Macbeth'].sort_values('year')

          title  year
159270  Macbeth  1913
21953   Macbeth  1916
111344  Macbeth  1948
124768  Macbeth  1987
159785  Macbeth  1997
120749  Macbeth  1998
56595   Macbeth  2003
169330  Macbeth  2004
49201   Macbeth  2006
27926   Macbeth  2009
143334  Macbeth  2012
71257   Macbeth  2013
44908   Macbeth  2014
109475  Macbeth  2015
90867   Macbeth  2017
44934   Macbeth  2018

In [32]:
t = titles
t[t.title == 'Macbeth'].sort_values('year').head()

          title  year
159270  Macbeth  1913
21953   Macbeth  1916
111344  Macbeth  1948
124768  Macbeth  1987
159785  Macbeth  1997

In [33]:
t = titles
t[t.title == 'Macbeth'].sort_values('year').tail()

          title  year
71257   Macbeth  2013
44908   Macbeth  2014
109475  Macbeth  2015
90867   Macbeth  2017
44934   Macbeth  2018

In [36]:
h = cast.head()
h[h.n.notnull()]

                 title  year      name   type        character     n
0       Closet Monster  2015  Buffy #1  actor          Buffy 4  31.0
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0